{
  "backend/main.mo": "Minimal Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report referencing the addition of mobile number 9973279335 in the global footer and listing related files, components, and metadata.",
  "frontend-file-summaries.txt": "Map of frontend file paths to their descriptions summarizing component behavior, hooks, styling, and app structure.",
  "frontend/index.css": "Tailwind base, component, and utility layers defining OKLCH color variables and light/dark theme tokens for global styling.",
  "frontend/index.html": "HTML entry point defining root container, loading main.tsx, and setting the page title.",
  "frontend/src/App.tsx": "Main app component managing roles, login, product/order state, admin notifications, and rendering layout with footer and views.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface for adding, editing, and deleting products with image upload, validation, dialogs, and toast feedback.",
  "frontend/src/components/HowToAddProducts.tsx": "Instructional card explaining steps for adding products with icons and a tip alert.",
  "frontend/src/components/LoginView.tsx": "Login form validating credentials and assigning customer or admin role based on username/password.",
  "frontend/src/components/OrdersPanel.tsx": "Admin panel component that groups and displays orders by customer and provides a clear-history confirmation flow.",
  "frontend/src/components/ShopView.tsx": "Product listing UI that sorts by sales, filters by search, and lets users place orders.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor tied to Internet Identity and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login state, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useOrders.ts": "LocalStorage-backed hook for loading, adding, and clearing customer orders.",
  "frontend/src/hooks/useProducts.ts": "LocalStorage-backed hook for loading, adding, updating, and deleting products with migration for legacy items.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light and dark theme colors.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering the main app.",
  "frontend/src/types/order.ts": "Order type defining product name, timestamp, and optional customer name.",
  "frontend/src/types/product.ts": "Product type defining id, name, price, and optional image.",
  "frontend/tailwind.config.js": "Tailwind config setting dark mode, content paths, extended theme colors, fonts, and utilities plus custom keyframes and plugins.",
  "project_state.json": "Defines project metadata, current features, and pending feature requests for adding a mobile number to the app footer."
}