{
  "backend/main.mo": "Actor implementing CRUD operations for products stored in a Map with price in paise and auto-incrementing IDs.",
  "backend/migration.mo": "Migration module converting old products with price to new products using pricePaise while preserving IDs and nextId.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base style file defining OKLCH color variables for light/dark themes and applying global styles.",
  "frontend/index.html": "HTML entry point setting page metadata and loading the React app root and main script.",
  "frontend/src/App.tsx": "Main React application controlling authentication, product/order state, notifications, and cross-tab order syncing.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface for adding, editing, and deleting products with validation, dialogs, image uploads, and toasts.",
  "frontend/src/components/HowToAddProducts.tsx": "Instructional UI card providing step-by-step guidance for adding products with styled alerts and icons.",
  "frontend/src/components/LoginView.tsx": "Login form component validating credentials and invoking onLogin with admin or customer roles.",
  "frontend/src/components/OrdersPanel.tsx": "Admin panel listing orders grouped by customer with ability to clear history via confirmation dialog.",
  "frontend/src/components/ShopView.tsx": "Product listing view with search and sorting by sales frequency, supporting ordering and loading states.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login state, and persisted identities.",
  "frontend/src/hooks/useOrders.ts": "LocalStorage-backed hook providing order list, addition, and clearing functionality.",
  "frontend/src/hooks/useProducts.ts": "Hook managing CRUD operations for products via backend actor using React Query for caching and mutations.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variable themes for light and dark modes, including colors and radius, and applies base body styles.",
  "frontend/src/lib/productMapping.ts": "Provides converters between backend and UI product formats, including bigint–price conversions and formatting utilities.",
  "frontend/src/lib/utils.ts": "Exports a class name merge helper and a utility to extract safe error messages.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/types/order.ts": "Defines the Order interface with product name, creation time, and optional customer name.",
  "frontend/src/types/product.ts": "Defines the Product interface with id, name, price string, and optional image.",
  "frontend/tailwind.config.js": "Configures Tailwind with plugins, custom colors mapped to CSS variables, fonts, radii, shadows, and animations.",
  "project_state.json": "Describes the project’s current state, known issues, and feature requirements for fixing product price handling and error visibility."
}