{
  "backend/main.mo": "Motoko actor storing products in a Map with CRUD methods and auto-incrementing IDs.",
  "backend/migration.mo": "Migration module initializing state with nextId and an empty product map.",
  "feature_evidence.json": "Feature evidence listing frontend files and components tied to product API migration and UI wiring.",
  "frontend-file-summaries.txt": "Prewritten summaries describing behavior of all major frontend components, hooks, and types.",
  "frontend/index.css": "Tailwind base/styles defining color tokens and theming for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and setting the page title.",
  "frontend/src/App.tsx": "Main React app handling roles, product/order hooks, toast notifications, and layout.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface for adding, editing, deleting products with validation and async operations.",
  "frontend/src/components/HowToAddProducts.tsx": "Instructional card showing simple steps for adding products in the admin area.",
  "frontend/src/components/LoginView.tsx": "Login form that validates input, checks admin credentials, and triggers onLogin with a derived role.",
  "frontend/src/components/OrdersPanel.tsx": "Admin panel that groups orders by customer, displays them, and allows clearing all order history with confirmation.",
  "frontend/src/components/ShopView.tsx": "Shop interface that sorts products by sales, filters them via search, and triggers ordering while handling loading states.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context providing Internet Identity login, logout, status tracking, and persisted identity handling.",
  "frontend/src/hooks/useOrders.ts": "LocalStorage-backed hook to store, add, and clear customer orders with timestamp metadata.",
  "frontend/src/hooks/useProducts.ts": "React Query hook that fetches, adds, updates, and deletes products through the backend actor with automatic cache invalidation.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark OKLCH color variables and base styles.",
  "frontend/src/lib/productMapping.ts": "Provides helpers to convert product data between backend bigint format and UI string format, plus price formatting.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, importing global styles.",
  "frontend/src/types/order.ts": "Defines the Order interface with product name, creation time, and optional customer name.",
  "frontend/src/types/product.ts": "Defines the Product interface with string id, name, price, and optional image.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, containers, and plugins using OKLCH variables.",
  "project_state.json": "Tracks project state, noting backend storage is unimplemented and listing related feature requirements."
}