{
  "backend/main.mo": "Motoko canister providing CRUD operations for products stored in a Map with auto-incrementing Nat IDs.",
  "feature_evidence.json": "Feature evidence report listing two frontend type‑normalization fixes tied to specific files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing components, hooks, types, and styling behavior.",
  "frontend/index.css": "Tailwind base/styles defining OKLCH color variables, theme tokens, and light/dark mode CSS variables.",
  "frontend/index.html": "HTML entry point setting page metadata and loading the main React script.",
  "frontend/src/App.tsx": "Main React app managing login, roles, product/order state, notifications, and cross‑tab order detection.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface for adding, editing, and deleting products with validation, dialogs, image upload, and toasts.",
  "frontend/src/components/HowToAddProducts.tsx": "Instructional card showing step‑by‑step guidance for adding products with icons and alerts.",
  "frontend/src/components/LoginView.tsx": "Login form handling username/password validation and determining admin vs customer roles.",
  "frontend/src/components/OrdersPanel.tsx": "Admin panel component that displays customer orders grouped by customer and supports clearing all order history with confirmation.",
  "frontend/src/components/ShopView.tsx": "Product listing UI that sorts by sales, supports search, and allows placing orders with loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identities, and status tracking.",
  "frontend/src/hooks/useOrders.ts": "Manages local order storage with add, clear, and persistence in localStorage.",
  "frontend/src/hooks/useProducts.ts": "React Query–based hook for fetching and mutating products through the backend actor.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme color variables and base styles.",
  "frontend/src/lib/productMapping.ts": "Utilities to convert product data between backend bigint formats and UI string formats, including price and ID parsing.",
  "frontend/src/lib/utils.ts": "Provides a Tailwind class merging helper and a function to extract safe error messages.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/types/order.ts": "Defines the Order interface with product name, creation date, and optional customer name.",
  "frontend/src/types/product.ts": "Defines the Product interface with id, name, price, and optional image.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theming, colors, fonts, animations, and plugins.",
  "project_state.json": "Describes project state, known issues, and features related to fixing product ID type mismatches."
}