{
  "backend/main.mo": "Actor storing products in a Map with CRUD methods and auto-incrementing IDs.",
  "backend/migration.mo": "Migration module defining persisted state and a no-op run function that returns the given state.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all frontend files.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color tokens, theming variables, and light/dark mode styles.",
  "frontend/index.html": "HTML entry point setting the page title and loading the React application root.",
  "frontend/src/App.tsx": "Main React app handling login, roles, product/order logic, admin notifications, UTM identifier, and global footer content.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface for adding, editing, deleting products with validation, image upload, dialogs, and toast feedback.",
  "frontend/src/components/HowToAddProducts.tsx": "Instructional card component explaining steps for adding products with icons and tips.",
  "frontend/src/components/LoginView.tsx": "Login form validating credentials and assigning admin or customer role based on username/password.",
  "frontend/src/components/OrdersPanel.tsx": "Displays grouped customer orders with clear-history functionality and UI dialogs.",
  "frontend/src/components/ShopView.tsx": "Shows sortable, searchable product list and allows placing orders with loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors and refetches dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useOrders.ts": "Manages orders in localStorage with functions to add and clear orders.",
  "frontend/src/hooks/useProducts.ts": "Fetches and mutates products via backend actor using React Query with add, update, and delete operations.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theming variables for light and dark modes.",
  "frontend/src/lib/productMapping.ts": "Converts product data between backend bigint format and UI string format, including price parsing.",
  "frontend/src/lib/utils.ts": "Utility for merging Tailwind class names using clsx and twMerge.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/types/order.ts": "Defines the Order interface with product name, timestamp, and optional customer name.",
  "frontend/src/types/product.ts": "Defines the Product interface with id, name, price, and optional image.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme settings, custom colors, fonts, shadows, and keyframes, plus plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, known issues, existing features, and pending feature requests related to fixing build/deploy failures and improving Motoko backend persistence and migrations."
}