{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Lists detected features, associated frontend files, components, test IDs, and confidence levels for build planning.",
  "frontend-file-summaries.txt": "Contains prewritten 1–2 sentence summaries for key frontend components, hooks, and types.",
  "frontend/index.css": "Tailwind base styles and OKLCH theme variables defining light/dark color schemes and global element styling.",
  "frontend/index.html": "Minimal HTML shell setting the app title and loading the React entry script.",
  "frontend/src/App.tsx": "Main app component managing authentication, product ordering, admin panels, and rendering ShopView with products and orders.",
  "frontend/src/components/AdminPanel.tsx": "Admin form for adding products with validation, success/error alerts, and embedded guidance component.",
  "frontend/src/components/HowToAddProducts.tsx": "Static instructional card explaining step-by-step how to add products, with icons and tips.",
  "frontend/src/components/LoginView.tsx": "Login form validating credentials, distinguishing admin vs customer, and reporting errors.",
  "frontend/src/components/OrdersPanel.tsx": "Displays grouped customer orders with admin controls and supports clearing order history.",
  "frontend/src/components/ShopView.tsx": "Shows products sorted by sales and allows placing new orders.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state via Internet Identity with login, logout, and identity persistence.",
  "frontend/src/hooks/useOrders.ts": "Manages order storage in localStorage with functions to add and clear orders.",
  "frontend/src/hooks/useProducts.ts": "Loads, stores, and updates product data in localStorage.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theming variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers.",
  "frontend/src/types/order.ts": "Defines the Order type with product, timestamp, and optional customer name.",
  "frontend/src/types/product.ts": "Defines the Product type with name and price fields.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, and plugins for the project.",
  "project_state.json": "Describes the current state of a single‑page web app with localStorage‑based product data, login rules, architectural notes, and known UI issues. Includes feature definitions and requirements for login, product persistence, shop view, and admin panel functionality."
}