{
  "kind": "build_request",
  "title": "Persist products permanently with Motoko backend storage and CRUD API",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Implement persistent product storage in `backend/main.mo` using stable state so products are saved permanently across canister upgrades (the current actor is empty). Add a Product data model compatible with the frontend (`id`, `name`, `price`, optional `image` as text) and store the full product list in stable storage.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-yes"
        ],
        "quotes": [
          "Now also products are not saved permanently",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "After deployment, creating products and then upgrading/redeploying the canister does not erase the saved products.",
        "Product fields persisted by the backend include: id (Text), name (Text), price (Text), image (optional Text).",
        "Backend compiles with all logic contained in `backend/main.mo` (single-actor architecture)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Expose backend CRUD + read APIs for products from `backend/main.mo`: list/get all products (query), create product (update), update product by id (update), delete product by id (update). Ensure IDs are unique and stable for each created product.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-yes"
        ],
        "quotes": [
          "Want me to rebuild your backend with: stable persistent product list * create/update/delete product functions * read functions",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "There is a query method that returns the current list of products.",
        "There is an update method to create a product and return the created product (including generated id).",
        "There is an update method to update an existing product by id and return the updated product (or a clear not-found result).",
        "There is an update method to delete a product by id and return a success/not-found result.",
        "Creating/updating/deleting products changes what `listProducts` returns immediately after the call."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update the frontend product data flow to use the backend product APIs instead of `localStorage`. Replace the current `useProducts` hook behavior (which reads/writes `localStorage`) with backend-backed fetching and mutations (using React Query) so product changes are shared across devices/browsers and persist permanently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-yes"
        ],
        "quotes": [
          "Now also products are not saved permanently"
        ]
      },
      "acceptanceCriteria": [
        "Refreshing the page does not lose products (products reload from the backend).",
        "Adding/editing/deleting a product in the Admin panel persists after a full page reload and on a different browser session.",
        "`frontend/src/hooks/useProducts.ts` no longer depends on `localStorage` for persistence.",
        "Product image upload (data URL string) continues to work end-to-end (saved and returned by backend)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Wire the existing UI components to the backend-backed products hook so existing admin/shop behaviors remain the same: `App.tsx` continues to pass `products`, `addProduct`, `updateProduct`, `deleteProduct` to `ShopView` and `AdminPanel`, but these operations now call the backend and keep UI state in sync (including loading/error handling with user-friendly English messages).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-yes"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "ShopView displays the backend product list correctly.",
        "AdminPanel add/edit/delete operations update the UI list and remain consistent after reload.",
        "If a backend call fails, the UI shows an English error message (e.g., toast) and does not corrupt the local UI state."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Verify build/deploy succeeds after these changes and the app retains the existing global footer content, including the English text \"Mobile: 9973279335\" in the footer.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-yes"
        ],
        "quotes": [
          "And rebuild"
        ]
      },
      "acceptanceCriteria": [
        "Project compiles and deploys successfully.",
        "The footer still shows \"Mobile: 9973279335\" at the bottom of the app."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo`.",
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui` (compose existing components instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Persisting orders permanently in the backend (orders currently use localStorage and are not part of this request).",
    "Adding Internet Identity or any new authentication/authorization rules for product CRUD (unless required purely to make the backend compile).",
    "Adding external databases or third-party services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}