{
  "kind": "build_request",
  "title": "Fix product load failure after adding products (ID type mismatch)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the product ID type mismatch that causes the UI to show an error (e.g., \"unable to load the product\") after adding any product by normalizing backend product IDs and pricePaise values to the UI’s expected types (UI Product.id must always be a string), even when the agent/runtime provides Nat values as JavaScript numbers instead of bigint.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "After adding any products"
        ]
      },
      "acceptanceCriteria": [
        "After adding a product in AdminPanel, the product list refreshes and displays the newly added product without any \"unable to load the product\" (or equivalent) error state.",
        "All products returned from the backend (including newly added ones) render with stable React keys and can be edited/deleted successfully.",
        "Product mapping handles backend numeric-like values robustly (e.g., id/pricePaise received as number or bigint), and always produces UI Product objects with id as string and price formatted with 2 decimals."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the products CRUD hook to ensure all backend calls receive correctly typed arguments derived from UI state: convert UI string IDs to Nat/bigint safely for update/delete operations, and ensure update-product data conversion does not pass an object containing an id field into the UI→backend mapping helper.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "After adding any products"
        ]
      },
      "acceptanceCriteria": [
        "Updating a product works after adding it (no \"Product not found\" due to ID conversion issues).",
        "Deleting a product works after adding it (no errors due to ID conversion issues).",
        "The update-product path does not pass a value containing an `id` field into the UI→backend conversion helper that expects `Omit<Product, 'id'>`."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only UI components).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add a migration in backend/migration.mo if a state schema change is required."
  ],
  "nonGoals": [
    "Adding new authentication methods beyond the existing Internet Identity setup.",
    "Adding external databases or third-party services.",
    "Redesigning the overall UI/UX beyond what is necessary to resolve the product loading failure."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}