{
  "kind": "build_request",
  "title": "Fix product saving and price formatting regression",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the product price mapping so that prices are stored in the backend as integer paise (cents) but displayed and edited in the UI as rupees with 2 decimal places, ensuring a product saved from AdminPanel shows the same price when reloaded.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Now also it is not working"
        ]
      },
      "acceptanceCriteria": [
        "When an admin adds a product with price \"12.50\", the product list in AdminPanel and ShopView displays \"₹12.50\" after the mutation completes.",
        "After a full page refresh, the product still displays \"₹12.50\" (no change to \"₹1250\" or similar).",
        "When editing an existing product, the edit dialog pre-fills the rupee price value (2 decimals) that matches what is displayed in the list.",
        "Backend continues storing price as an integer amount (paise/cents), not a float."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the frontend update-product data conversion to avoid passing an object that includes an `id` field into `uiToBackendProductData` (which expects `Omit<Product, 'id'>`), and ensure add/update/delete product mutations reliably call the backend with correctly typed arguments.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Now also it is not working"
        ]
      },
      "acceptanceCriteria": [
        "TypeScript build succeeds with no type errors related to product mapping/conversion.",
        "Updating a product name and/or price in the AdminPanel succeeds and persists after refresh.",
        "Deleting a product in the AdminPanel succeeds and the product is removed after refresh."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve error visibility for failed product save/update/delete operations by surfacing the underlying error message (when available) in the UI toast and console, so failures are diagnosable without guessing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Now also it is not working"
        ]
      },
      "acceptanceCriteria": [
        "If add/update/delete fails, the toast includes a short error reason when available (fallback to a generic English message if not).",
        "The console log includes the caught error object for add/update/delete failures."
      ]
    }
  ],
  "constraints": [
    "Keep all existing user-facing text in English.",
    "Do not modify the existing global footer content in frontend/src/App.tsx, including the text \"Mobile: 9973279335\".",
    "Do not edit any files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing a new authentication system or changing login behavior.",
    "Adding new product fields beyond name, price, and optional image.",
    "Introducing external databases or third-party services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}