{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Normalize product ID and price types across product CRUD to prevent post-create load failures",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Harden backend→UI product normalization so UI Product.id is always a string and price always formats to 2 decimals even when backend Nat-like values arrive as number/bigint.",
      "acceptanceCriteria": [
        "After adding a product in AdminPanel, the product list refreshes and displays the newly added product without any \"unable to load the product\" (or equivalent) error state.",
        "All products returned from the backend (including newly added ones) render with stable React keys and can be edited/deleted successfully.",
        "Product mapping handles backend numeric-like values robustly (e.g., id/pricePaise received as number or bigint), and always produces UI Product objects with id as string and price formatted with 2 decimals."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/productMapping.ts",
          "operation": "modify",
          "description": "Update backendToUIProduct and related helpers to accept and normalize numeric-like values (bigint | number | string) for id and pricePaise: ensure UI Product.id is always String(...) and price is always rendered with exactly 2 decimals; avoid relying on direct Number(bigint) conversions where possible by normalizing to bigint safely first."
        },
        {
          "path": "frontend/src/hooks/useProducts.ts",
          "operation": "modify",
          "description": "Ensure fetched/created products are mapped through the hardened backend→UI normalization so React list keys remain stable strings and the UI never enters an error state due to unexpected number vs bigint values from the runtime."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix products CRUD hook argument typing by safely converting UI string IDs to bigint for update/delete and ensuring UI→backend mapping helpers receive id-less data on update.",
      "acceptanceCriteria": [
        "Updating a product works after adding it (no \"Product not found\" due to ID conversion issues).",
        "Deleting a product works after adding it (no errors due to ID conversion issues).",
        "The update-product path does not pass a value containing an `id` field into the UI→backend conversion helper that expects `Omit<Product, 'id'>`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/productMapping.ts",
          "operation": "modify",
          "description": "Add/adjust shared conversion utilities to safely parse UI id strings into bigint for backend calls (with validation and clear errors) and to normalize Nat-like values when needed, so hooks can reuse consistent conversion logic."
        },
        {
          "path": "frontend/src/hooks/useProducts.ts",
          "operation": "modify",
          "description": "Update update/delete mutations to convert UI id:string to bigint via a safe parsing helper (instead of raw BigInt(id)); in the update flow, call uiToBackendProductData with an explicit Omit<Product,'id'> (e.g., { name, price, image }) rather than passing an object that includes id, and ensure update/delete use the parsed bigint id consistently."
        }
      ]
    }
  ]
}