{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend build hardening and footer text preservation for successful deployment",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Resolve any frontend-side build/deploy blockers and ensure the frontend compiles cleanly in the pipeline.",
      "acceptanceCriteria": [
        "`dfx build` (or the platform build step) completes without errors for both backend and frontend.",
        "Deployment completes successfully (no build-time or deploy-time errors)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden runtime-only references (e.g., window usage in rendered markup) so the app can compile in strict build/pipeline environments while keeping existing UI behavior. Ensure any changes do not alter user-facing text."
        },
        {
          "path": "frontend/public/assets/generated/rajesh-kurkure-garhwa-logo-from-upload.dim_256x256.png",
          "operation": "create",
          "description": "Add the referenced header logo asset at this exact path so the production build can reliably include it (source: existing workspace asset `generated/rajesh-kurkure-garhwa-logo-from-upload.dim_256x256.png`)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Preserve all existing English user-facing text and keep the global footer content unchanged, including the exact mobile number string.",
      "acceptanceCriteria": [
        "The footer still displays \"Mobile: 9973279335\" exactly.",
        "No user-facing text is changed to a non-English language as part of the fix."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify and preserve the footer content and text exactly as-is (including \"Mobile: 9973279335\"). If refactoring for build safety, ensure all user-facing strings remain English and unchanged."
        }
      ]
    }
  ]
}